MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32L4P5CG/mcu.h
#define LTDC_LxDCCR_DCBLUE_Pos       (0U)
#define LTDC_LxDCCR_DCBLUE_Msk       (0xFFUL << LTDC_LxDCCR_DCBLUE_Pos)        /*!< 0x000000FF */
#define LTDC_LxDCCR_DCBLUE           LTDC_LxDCCR_DCBLUE_Msk                    /*!< Default Color Blue  */
#define LTDC_LxDCCR_DCGREEN_Pos      (8U)
#define LTDC_LxDCCR_DCGREEN_Msk      (0xFFUL << LTDC_LxDCCR_DCGREEN_Pos)       /*!< 0x0000FF00 */
#define LTDC_LxDCCR_DCGREEN          LTDC_LxDCCR_DCGREEN_Msk                   /*!< Default Color Green */
#define LTDC_LxDCCR_DCRED_Pos        (16U)
#define LTDC_LxDCCR_DCRED_Msk        (0xFFUL << LTDC_LxDCCR_DCRED_Pos)         /*!< 0x00FF0000 */
#define LTDC_LxDCCR_DCRED            LTDC_LxDCCR_DCRED_Msk                     /*!< Default Color Red   */
#define LTDC_LxDCCR_DCALPHA_Pos      (24U)
#define LTDC_LxDCCR_DCALPHA_Msk      (0xFFUL << LTDC_LxDCCR_DCALPHA_Pos)       /*!< 0xFF000000 */
#define LTDC_LxDCCR_DCALPHA          LTDC_LxDCCR_DCALPHA_Msk                   /*!< Default Color Alpha */

/********************  Bit definition for LTDC_LxBFCR register  ***************/

#define LTDC_LxBFCR_BF2_Pos          (0U)
#define LTDC_LxBFCR_BF2_Msk          (0x7UL << LTDC_LxBFCR_BF2_Pos)            /*!< 0x00000007 */
#define LTDC_LxBFCR_BF2              LTDC_LxBFCR_BF2_Msk                       /*!< Blending Factor 2 */
#define LTDC_LxBFCR_BF1_Pos          (8U)
#define LTDC_LxBFCR_BF1_Msk          (0x7UL << LTDC_LxBFCR_BF1_Pos)            /*!< 0x00000700 */
#define LTDC_LxBFCR_BF1              LTDC_LxBFCR_BF1_Msk                       /*!< Blending Factor 1 */

/********************  Bit definition for LTDC_LxCFBAR register  **************/

#define LTDC_LxCFBAR_CFBADD_Pos      (0U)
#define LTDC_LxCFBAR_CFBADD_Msk      (0xFFFFFFFFUL << LTDC_LxCFBAR_CFBADD_Pos) /*!< 0xFFFFFFFF */
#define LTDC_LxCFBAR_CFBADD          LTDC_LxCFBAR_CFBADD_Msk                   /*!< Color Frame Buffer Start Address */

/********************  Bit definition for LTDC_LxCFBLR register  **************/

#define LTDC_LxCFBLR_CFBLL_Pos       (0U)
#define LTDC_LxCFBLR_CFBLL_Msk       (0x1FFFUL << LTDC_LxCFBLR_CFBLL_Pos)      /*!< 0x00001FFF */
#define LTDC_LxCFBLR_CFBLL           LTDC_LxCFBLR_CFBLL_Msk                    /*!< Color Frame Buffer Line Length    */
#define LTDC_LxCFBLR_CFBP_Pos        (16U)
#define LTDC_LxCFBLR_CFBP_Msk        (0x1FFFUL << LTDC_LxCFBLR_CFBP_Pos)       /*!< 0x1FFF0000 */
#define LTDC_LxCFBLR_CFBP            LTDC_LxCFBLR_CFBP_Msk                     /*!< Color Frame Buffer Pitch in bytes */

/********************  Bit definition for LTDC_LxCFBLNR register  *************/

#define LTDC_LxCFBLNR_CFBLNBR_Pos    (0U)
#define LTDC_LxCFBLNR_CFBLNBR_Msk    (0x7FFUL << LTDC_LxCFBLNR_CFBLNBR_Pos)    /*!< 0x000007FF */
#define LTDC_LxCFBLNR_CFBLNBR        LTDC_LxCFBLNR_CFBLNBR_Msk                 /*!< Frame Buffer Line Number */

/********************  Bit definition for LTDC_LxCLUTWR register  *************/

#define LTDC_LxCLUTWR_BLUE_Pos       (0U)
#define LTDC_LxCLUTWR_BLUE_Msk       (0xFFUL << LTDC_LxCLUTWR_BLUE_Pos)        /*!< 0x000000FF */
#define LTDC_LxCLUTWR_BLUE           LTDC_LxCLUTWR_BLUE_Msk                    /*!< Blue value   */
#define LTDC_LxCLUTWR_GREEN_Pos      (8U)
#define LTDC_LxCLUTWR_GREEN_Msk      (0xFFUL << LTDC_LxCLUTWR_GREEN_Pos)       /*!< 0x0000FF00 */
#define LTDC_LxCLUTWR_GREEN          LTDC_LxCLUTWR_GREEN_Msk                   /*!< Green value  */
#define LTDC_LxCLUTWR_RED_Pos        (16U)
#define LTDC_LxCLUTWR_RED_Msk        (0xFFUL << LTDC_LxCLUTWR_RED_Pos)         /*!< 0x00FF0000 */
#define LTDC_LxCLUTWR_RED            LTDC_LxCLUTWR_RED_Msk                     /*!< Red value    */
#define LTDC_LxCLUTWR_CLUTADD_Pos    (24U)
#define LTDC_LxCLUTWR_CLUTADD_Msk    (0xFFUL << LTDC_LxCLUTWR_CLUTADD_Pos)     /*!< 0xFF000000 */
#define LTDC_LxCLUTWR_CLUTADD        LTDC_LxCLUTWR_CLUTADD_Msk                 /*!< CLUT address */

/******************************************************************************/
/*                                                                            */
/*                  Parallel Synchronous Slave Interface                      */
/*                                                                            */
/******************************************************************************/

/********************  Bits definition for PSSI_CR register  ******************/
#define PSSI_CR_CKPOL_Pos             (5U)
#define PSSI_CR_CKPOL_Msk             (0x1UL << PSSI_CR_CKPOL_Pos)             /*!< 0x00000020 */
#define PSSI_CR_CKPOL                 PSSI_CR_CKPOL_Msk                        /*!< Parallel data clock polarity */
#define PSSI_CR_DEPOL_Pos             (6U)
#define PSSI_CR_DEPOL_Msk             (0x1UL << PSSI_CR_DEPOL_Pos)             /*!< 0x00000040 */
#define PSSI_CR_DEPOL                 PSSI_CR_DEPOL_Msk                        /*!< Data enable (DE) polarity */
#define PSSI_CR_RDYPOL_Pos            (8U)
#define PSSI_CR_RDYPOL_Msk            (0x1UL << PSSI_CR_RDYPOL_Pos)            /*!< 0x00000100 */
#define PSSI_CR_RDYPOL                PSSI_CR_RDYPOL_Msk                       /*!< Ready (RDY) polarity */
#define PSSI_CR_EDM_Pos               (10U)
#define PSSI_CR_EDM_Msk               (0x3UL << PSSI_CR_EDM_Pos)               /*!< 0x00000C00 */
#define PSSI_CR_EDM                   PSSI_CR_EDM_Msk                          /*!< PSSI Extended data mode EDM[1:0] */
#define PSSI_CR_EDM_0                 (0x1UL << PSSI_CR_EDM_Pos)               /*!< 0x00000400 */
#define PSSI_CR_EDM_1                 (0x2UL << PSSI_CR_EDM_Pos)               /*!< 0x00000800 */
#define PSSI_CR_ENABLE_Pos            (14U)
#define PSSI_CR_ENABLE_Msk            (0x1UL << PSSI_CR_ENABLE_Pos)            /*!< 0x00004000 */
#define PSSI_CR_ENABLE                PSSI_CR_ENABLE_Msk                       /*!< PSSI enable */
#define PSSI_CR_DERDYCFG_Pos          (18U)
#define PSSI_CR_DERDYCFG_Msk          (0x7UL << PSSI_CR_DERDYCFG_Pos)          /*!< 0x001C0000 */
#define PSSI_CR_DERDYCFG              PSSI_CR_DERDYCFG_Msk                     /*!< Data enable and ready configuration */
#define PSSI_CR_DERDYCFG_0            (0x1UL << PSSI_CR_EDM_Pos)               /*!< 0x00040000 */
#define PSSI_CR_DERDYCFG_1            (0x2UL << PSSI_CR_EDM_Pos)               /*!< 0x00080000 */
#define PSSI_CR_DERDYCFG_2            (0x4UL << PSSI_CR_EDM_Pos)               /*!< 0x00100000 */
#define PSSI_CR_DMAEN_Pos             (30U)
#define PSSI_CR_DMAEN_Msk             (0x1UL << PSSI_CR_DMAEN_Pos)             /*!< 0x40000000 */
#define PSSI_CR_DMAEN                 PSSI_CR_DMAEN_Msk                        /*!< DMA Enable */
#define PSSI_CR_OUTEN_Pos             (31U)
#define PSSI_CR_OUTEN_Msk             (0x1UL << PSSI_CR_OUTEN_Pos)             /*!< 0x80000000 */
#define PSSI_CR_OUTEN                 PSSI_CR_OUTEN_Msk                        /*!< Select direction of the data */

